Resources/recordings/garethp/ews/Test/Contacts/ContactsAPITest.testDeleteContactField.json

[{"error":false,"statusCode":200,"headers":{"Cache-Control":["private"],"Transfer-Encoding":["chunked"],"Content-Type":["text\/xml; charset=utf-8"],"Server":["Microsoft-IIS\/10.0"],"request-id":["8d9ef8f9-a48a-4217-bc75-fd58eb214e80"],"X-CalculatedBETarget":["LO2P123MB2462.GBRP123.PROD.OUTLOOK.COM"],"X-BackEndHttpStatus":["200"],"Set-Cookie":["exchangecookie=0b1039c1fded40da9d90129756ce8d15; expires=Tue, 21-Jul-2020 11:48:11 GMT; path=\/; secure; HttpOnly"],"X-RUM-Validated":["1"],"x-EwsHandler":["FindFolder"],"X-AspNet-Version":["4.0.30319"],"X-BeSku":["WCS5"],"X-DiagInfo":["LO2P123MB2462"],"X-BEServer":["LO2P123MB2462"],"X-Powered-By":["ASP.NET"],"X-FEServer":["LO2P265CA0159"],"Date":["Sun, 21 Jul 2019 11:48:10 GMT"]},"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><s:Header><h:ServerVersionInfo MajorVersion=\"15\" MinorVersion=\"20\" MajorBuildNumber=\"2094\" MinorBuildNumber=\"16\" Version=\"V2018_01_08\" xmlns:h=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\"\/><\/s:Header><s:Body><m:FindFolderResponse xmlns:m=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/messages\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xmlns:t=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\"><m:ResponseMessages><m:FindFolderResponseMessage ResponseClass=\"Success\"><m:ResponseCode>NoError<\/m:ResponseCode><m:RootFolder TotalItemsInView=\"8\" IncludesLastItemInRange=\"true\"><t:Folders><t:ContactsFolder><t:FolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgEnAAAA\" ChangeKey=\"AwAAABYAAAC30utV9Qm1Tp6i563HuBDKAAAAAASd\"\/><t:ParentFolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgEOAAAA\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact.MOC.QuickContacts<\/t:FolderClass><t:DisplayName>{06967759-274D-40B2-A3EB-D7F9E73727D7}<\/t:DisplayName><t:TotalCount>0<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><t:ContactsFolder><t:FolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgEoAAAA\" ChangeKey=\"AwAAABYAAAC30utV9Qm1Tp6i563HuBDKAAAAAASm\"\/><t:ParentFolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgEOAAAA\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact.MOC.ImContactList<\/t:FolderClass><t:DisplayName>{A9E2BC46-B3A0-4243-B315-60D991004455}<\/t:DisplayName><t:TotalCount>0<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><t:ContactsFolder><t:FolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgEvAAAA\" ChangeKey=\"AwAAABYAAAC30utV9Qm1Tp6i563HuBDKAAAAAAUK\"\/><t:ParentFolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgEOAAAA\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact.Company<\/t:FolderClass><t:DisplayName>Companies<\/t:DisplayName><t:TotalCount>0<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><t:ContactsFolder><t:FolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgEsAAAA\" ChangeKey=\"AwAAABYAAAC30utV9Qm1Tp6i563HuBDKAAAAAATs\"\/><t:ParentFolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgEOAAAA\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact.GalContacts<\/t:FolderClass><t:DisplayName>GAL Contacts<\/t:DisplayName><t:TotalCount>0<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><t:ContactsFolder><t:FolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgErAAAA\" ChangeKey=\"AwAAABYAAAC30utV9Qm1Tp6i563HuBDKAAAAAATj\"\/><t:ParentFolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgEOAAAA\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact.OrganizationalContacts<\/t:FolderClass><t:DisplayName>Organizational Contacts<\/t:DisplayName><t:TotalCount>0<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><t:ContactsFolder><t:FolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgEqAAAA\" ChangeKey=\"AwAAABYAAAC30utV9Qm1Tp6i563HuBDKAAAAAATX\"\/><t:ParentFolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgEOAAAA\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact.PeopleCentricConversationBuddies<\/t:FolderClass><t:DisplayName>PeopleCentricConversation Buddies<\/t:DisplayName><t:TotalCount>0<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><t:ContactsFolder><t:FolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgElAAAA\" ChangeKey=\"AwAAABYAAAC30utV9Qm1Tp6i563HuBDKAAAAAASL\"\/><t:ParentFolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgEOAAAA\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact.RecipientCache<\/t:FolderClass><t:DisplayName>Recipient Cache<\/t:DisplayName><t:TotalCount>0<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><t:ContactsFolder><t:FolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAm6AAAAA\" ChangeKey=\"AwAAABYAAAC30utV9Qm1Tp6i563HuBDKAAAAAAl3\"\/><t:ParentFolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAgEOAAAA\" ChangeKey=\"AQAAAA==\"\/><t:FolderClass>IPF.Contact<\/t:FolderClass><t:DisplayName>Test<\/t:DisplayName><t:TotalCount>0<\/t:TotalCount><t:ChildFolderCount>0<\/t:ChildFolderCount><t:EffectiveRights><t:CreateAssociated>true<\/t:CreateAssociated><t:CreateContents>true<\/t:CreateContents><t:CreateHierarchy>true<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><\/t:ContactsFolder><\/t:Folders><\/m:RootFolder><\/m:FindFolderResponseMessage><\/m:ResponseMessages><\/m:FindFolderResponse><\/s:Body><\/s:Envelope>"},{"error":false,"statusCode":200,"headers":{"Cache-Control":["private"],"Transfer-Encoding":["chunked"],"Content-Type":["text\/xml; charset=utf-8"],"Server":["Microsoft-IIS\/10.0"],"request-id":["3de53df3-f924-4123-a218-9c19c12ae437"],"X-CalculatedBETarget":["LO2P123MB2462.GBRP123.PROD.OUTLOOK.COM"],"X-BackEndHttpStatus":["200"],"Set-Cookie":["exchangecookie=973b4cd29ed94961863fe297cded1687; expires=Tue, 21-Jul-2020 11:48:11 GMT; path=\/; secure; HttpOnly"],"X-RUM-Validated":["1"],"x-EwsHandler":["CreateItem"],"X-AspNet-Version":["4.0.30319"],"X-BeSku":["WCS5"],"X-DiagInfo":["LO2P123MB2462"],"X-BEServer":["LO2P123MB2462"],"X-Powered-By":["ASP.NET"],"X-FEServer":["LO2P265CA0159"],"Date":["Sun, 21 Jul 2019 11:48:10 GMT"]},"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><s:Header><h:ServerVersionInfo MajorVersion=\"15\" MinorVersion=\"20\" MajorBuildNumber=\"2094\" MinorBuildNumber=\"16\" Version=\"V2018_01_08\" xmlns:h=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\"\/><\/s:Header><s:Body><m:CreateItemResponse xmlns:m=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/messages\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xmlns:t=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\"><m:ResponseMessages><m:CreateItemResponseMessage ResponseClass=\"Success\"><m:ResponseCode>NoError<\/m:ResponseCode><m:Items><t:Contact><t:ItemId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwBGAAAD1ufEotoeQ0eOxEbIe+pv2QcAt9LrVfUJtU6eouetx7gQygAAAm6AAAAAt9LrVfUJtU6eouetx7gQygAAAn8LAAAA\" ChangeKey=\"EQAAABYAAAC30utV9Qm1Tp6i563HuBDKAAAAAAtm\"\/><\/t:Contact><\/m:Items><\/m:CreateItemResponseMessage><\/m:ResponseMessages><\/m:CreateItemResponse><\/s:Body><\/s:Envelope>"},{"error":false,"statusCode":200,"headers":{"Cache-Control":["private"],"Transfer-Encoding":["chunked"],"Content-Type":["text\/xml; charset=utf-8"],"Server":["Microsoft-IIS\/10.0"],"request-id":["37b8132e-a99a-4fe8-ad71-13bcc2a97887"],"X-CalculatedBETarget":["LO2P123MB2462.GBRP123.PROD.OUTLOOK.COM"],"X-BackEndHttpStatus":["200"],"Set-Cookie":["exchangecookie=cd0565230a704bb289ee07071b220f39; expires=Tue, 21-Jul-2020 11:48:11 GMT; path=\/; secure; HttpOnly"],"X-RUM-Validated":["1"],"x-EwsHandler":["UpdateItem"],"X-AspNet-Version":["4.0.30319"],"X-BeSku":["WCS5"],"X-DiagInfo":["LO2P123MB2462"],"X-BEServer":["LO2P123MB2462"],"X-Powered-By":["ASP.NET"],"X-FEServer":["LO2P265CA0159"],"Date":["Sun, 21 Jul 2019 11:48:11 GMT"]},"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><s:Header><h:ServerVersionInfo MajorVersion=\"15\" MinorVersion=\"20\" MajorBuildNumber=\"2094\" MinorBuildNumber=\"16\" Version=\"V2018_01_08\" xmlns:h=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\"\/><\/s:Header><s:Body><m:UpdateItemResponse xmlns:m=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/messages\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xmlns:t=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\"><m:ResponseMessages><m:UpdateItemResponseMessage ResponseClass=\"Success\"><m:ResponseCode>NoError<\/m:ResponseCode><m:Items><t:Contact><t:ItemId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwBGAAAD1ufEotoeQ0eOxEbIe+pv2QcAt9LrVfUJtU6eouetx7gQygAAAm6AAAAAt9LrVfUJtU6eouetx7gQygAAAn8LAAAA\" ChangeKey=\"EQAAABYAAAC30utV9Qm1Tp6i563HuBDKAAAAAAtq\"\/><\/t:Contact><\/m:Items><m:ConflictResults><t:Count>0<\/t:Count><\/m:ConflictResults><\/m:UpdateItemResponseMessage><\/m:ResponseMessages><\/m:UpdateItemResponse><\/s:Body><\/s:Envelope>"},{"error":false,"statusCode":200,"headers":{"Cache-Control":["private"],"Transfer-Encoding":["chunked"],"Content-Type":["text\/xml; charset=utf-8"],"Server":["Microsoft-IIS\/10.0"],"request-id":["23d21fcb-8a4e-4efd-b48e-9e0a22e01507"],"X-CalculatedBETarget":["LO2P123MB2462.GBRP123.PROD.OUTLOOK.COM"],"X-BackEndHttpStatus":["200"],"Set-Cookie":["exchangecookie=2c12b83ca928401fbf69d67060ce6508; expires=Tue, 21-Jul-2020 11:48:11 GMT; path=\/; secure; HttpOnly"],"X-RUM-Validated":["1"],"x-EwsHandler":["GetItem"],"X-AspNet-Version":["4.0.30319"],"X-BeSku":["WCS5"],"X-DiagInfo":["LO2P123MB2462"],"X-BEServer":["LO2P123MB2462"],"X-Powered-By":["ASP.NET"],"X-FEServer":["LO2P265CA0159"],"Date":["Sun, 21 Jul 2019 11:48:11 GMT"]},"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><s:Header><h:ServerVersionInfo MajorVersion=\"15\" MinorVersion=\"20\" MajorBuildNumber=\"2094\" MinorBuildNumber=\"16\" Version=\"V2018_01_08\" xmlns:h=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\"\/><\/s:Header><s:Body><m:GetItemResponse xmlns:m=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/messages\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xmlns:t=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\"><m:ResponseMessages><m:GetItemResponseMessage ResponseClass=\"Success\"><m:ResponseCode>NoError<\/m:ResponseCode><m:Items><t:Contact><t:ItemId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwBGAAAD1ufEotoeQ0eOxEbIe+pv2QcAt9LrVfUJtU6eouetx7gQygAAAm6AAAAAt9LrVfUJtU6eouetx7gQygAAAn8LAAAA\" ChangeKey=\"EQAAABYAAAC30utV9Qm1Tp6i563HuBDKAAAAAAtq\"\/><t:ParentFolderId Id=\"AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAuAAAD1ufEotoeQ0eOxEbIe+pv2QEAt9LrVfUJtU6eouetx7gQygAAAm6AAAAA\" ChangeKey=\"AQAAAA==\"\/><t:ItemClass>IPM.Contact<\/t:ItemClass><t:Subject>Smith<\/t:Subject><t:Sensitivity>Normal<\/t:Sensitivity><t:Body BodyType=\"Text\"\/><t:DateTimeReceived>2019-07-21T11:48:11Z<\/t:DateTimeReceived><t:Size>7483<\/t:Size><t:Importance>Normal<\/t:Importance><t:IsSubmitted>false<\/t:IsSubmitted><t:IsDraft>true<\/t:IsDraft><t:IsFromMe>false<\/t:IsFromMe><t:IsResend>false<\/t:IsResend><t:IsUnmodified>false<\/t:IsUnmodified><t:DateTimeSent>2019-07-21T11:48:11Z<\/t:DateTimeSent><t:DateTimeCreated>2019-07-21T11:48:11Z<\/t:DateTimeCreated><t:DisplayCc\/><t:DisplayTo\/><t:HasAttachments>false<\/t:HasAttachments><t:Culture>en-US<\/t:Culture><t:EffectiveRights><t:CreateAssociated>false<\/t:CreateAssociated><t:CreateContents>false<\/t:CreateContents><t:CreateHierarchy>false<\/t:CreateHierarchy><t:Delete>true<\/t:Delete><t:Modify>true<\/t:Modify><t:Read>true<\/t:Read><\/t:EffectiveRights><t:LastModifiedName>Gareth Parker<\/t:LastModifiedName><t:LastModifiedTime>2019-07-21T11:48:11Z<\/t:LastModifiedTime><t:IsAssociated>false<\/t:IsAssociated><t:WebClientReadFormQueryString>https:\/\/outlook.office365.com\/owa\/?ItemID=AQMkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwBGAAAD1ufEotoeQ0eOxEbIe%2Bpv2QcAt9LrVfUJtU6eouetx7gQygAAAm6AAAAAt9LrVfUJtU6eouetx7gQygAAAn8LAAAA&amp;exvsurl=1&amp;viewmodel=PersonaCardViewModelFactory<\/t:WebClientReadFormQueryString><t:ConversationId Id=\"AAQkADllMTlhYmUxLTg5MTctNDI4ZS1iNDdlLTM2NTk2Y2E5ODA0MwAQAL9Q4GEhNn1JgglKdtGyXX8=\"\/><t:FileAs\/><t:FileAsMapping>None<\/t:FileAsMapping><t:DisplayName>Smith<\/t:DisplayName><t:CompleteName><t:LastName>Smith<\/t:LastName><t:FullName>Smith<\/t:FullName><\/t:CompleteName><t:EmailAddresses><t:Entry Key=\"EmailAddress1\" Name=\"john.smith@gmail.com\" RoutingType=\"SMTP\" MailboxType=\"Contact\">john.smith@gmail.com<\/t:Entry><\/t:EmailAddresses><t:PhysicalAddresses><t:Entry Key=\"Business\"><t:Street>123 Street<\/t:Street><t:State>123 State<\/t:State><\/t:Entry><\/t:PhysicalAddresses><t:Surname>Smith<\/t:Surname><t:AccountName>0dFDodlpkX+FplyZJh3LX2bfu9E=<\/t:AccountName><t:ObjectId>a99524f7c5f543c7b70a95fa8723d6ca<\/t:ObjectId><t:SourceId>EXCH<\/t:SourceId><\/t:Contact><\/m:Items><\/m:GetItemResponseMessage><\/m:ResponseMessages><\/m:GetItemResponse><\/s:Body><\/s:Envelope>"},{"error":false,"statusCode":200,"headers":{"Cache-Control":["private"],"Transfer-Encoding":["chunked"],"Content-Type":["text\/xml; charset=utf-8"],"Server":["Microsoft-IIS\/10.0"],"request-id":["4bb11038-71b7-4d60-9247-a93e9ad7b186"],"X-CalculatedBETarget":["LO2P123MB2462.GBRP123.PROD.OUTLOOK.COM"],"X-BackEndHttpStatus":["200"],"Set-Cookie":["exchangecookie=487ca5b7f4ad41c880a876bd7640b01f; expires=Tue, 21-Jul-2020 11:48:12 GMT; path=\/; secure; HttpOnly"],"X-RUM-Validated":["1"],"x-EwsHandler":["DeleteItem"],"X-AspNet-Version":["4.0.30319"],"X-BeSku":["WCS5"],"X-DiagInfo":["LO2P123MB2462"],"X-BEServer":["LO2P123MB2462"],"X-Powered-By":["ASP.NET"],"X-FEServer":["LO2P265CA0159"],"Date":["Sun, 21 Jul 2019 11:48:11 GMT"]},"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?><s:Envelope xmlns:s=\"http:\/\/schemas.xmlsoap.org\/soap\/envelope\/\"><s:Header><h:ServerVersionInfo MajorVersion=\"15\" MinorVersion=\"20\" MajorBuildNumber=\"2094\" MinorBuildNumber=\"16\" Version=\"V2018_01_08\" xmlns:h=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\"\/><\/s:Header><s:Body><m:DeleteItemResponse xmlns:m=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/messages\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xmlns:t=\"http:\/\/schemas.microsoft.com\/exchange\/services\/2006\/types\"><m:ResponseMessages><m:DeleteItemResponseMessage ResponseClass=\"Success\"><m:ResponseCode>NoError<\/m:ResponseCode><\/m:DeleteItemResponseMessage><\/m:ResponseMessages><\/m:DeleteItemResponse><\/s:Body><\/s:Envelope>"}]